[
  {
    "name": "Woody Allen",
    "description": "The filmmaker and his wife Soon-Yi Previn were regular guests at Epstein's Upper East Side townhouse for several years beginning in 2010, two years after Epstein's sentencing. In a letter to Epstein on his 63rd birthday, Allen wrote \"Always accept. Always interesting\" regarding the dinners. Photographs released by House Oversight Committee Democrats in December 2025 showed Allen and Epstein together in various settings, including at a table after a meal, on a film set, and on a private plane alongside Larry Summers. In a September 2025 interview with The Sunday Times, Allen called Epstein \"charming and personable\" and \"a substantial character,\" describing dinners attended by \"college professors, scientists, Nobel laureates.\" Allen said Epstein told him he had been \"falsely put in jail\" and",
    "category": "political",
    "occupation": "filmmaker",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Woody_Allen"
  },
  {
    "name": "Anil Ambani",
    "description": "Documents show communications between the Indian businessman and Jeffrey Epstein from 2017 to 2019. Ambani was introduced to Epstein by Sultan Ahmed bin Sulayem in February 2017. According to the messages, Ambani sought Epstein's advice on engaging with the White House on India–U.S. relations and defense cooperation, and later requested assistance in arranging meetings with senior U.S. officials, including Jared Kushner and Steve Bannon, in connection with a planned visit to Washington by Prime Minister Narendra Modi. On May 23, 2019—the day Modi secured re-election—Ambani visited Epstein's Manhattan townhouse. That evening, Epstein told Bannon that the meeting had been \"interesting\" and said that a representative of Modi claimed there was limited access to U.S. officials in Washington. Th",
    "category": "political",
    "occupation": "Indian businessman",
    "nationality": "Indian",
    "status": "convicted",
    "role": "Co-conspirator",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Anil_Ambani"
  },
  {
    "name": "Eva Andersson-Dubin",
    "description": "Eva Andersson-Dubin, a former girlfriend of Epstein, continued to associate with him after he was jailed for soliciting child prostitution in 2008. In a 2010 email, Andersson-Dubin wrote to Epstein: \"Come and visit next week, Celina will have 5 friends over.\" Celina, Andersson-Dubin's daughter, was fifteen years old at the time.",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Eva_Andersson-Dubin"
  },
  {
    "name": "Dan Ariely",
    "description": "The Duke University professor and author had a longstanding relationship with Epstein, as revealed by the Department of Justice's release of documents in 2026. One of the documents released on January 30, 2026 included an image of an email from Ariely to Epstein in which he requests the name and email of a \"redhead\" that had been introduced to him by Epstein.",
    "category": "political",
    "occupation": "Duke University professor",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Dan_Ariely"
  },
  {
    "name": "Peter Attia",
    "description": "The longevity influencer appeared in the files over 1,700 times. Emails showed Attia joking with Epstein and expressing that the \"worst\" part of their friendship was that \"the life you lead is so outrageous, and yet I can't tell a soul.\"",
    "category": "political",
    "occupation": "Royalty",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Peter_Attia"
  },
  {
    "name": "José María Aznar",
    "description": "The former Prime Minister of Spain and his wife Ana Botella are listed in the files as recipients of two parcels from Epstein, the first in 2003 and the second in 2004 when he was no longer in office. The contents of the packages were not specified.",
    "category": "political",
    "occupation": "former Prime Minister of Spain",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jos%C3%A9_Mar%C3%ADa_Aznar"
  },
  {
    "name": "Joscha Bach",
    "description": "The Media Lab used money provided by Epstein to support the work of Bach, an A.I. researcher, according to a 2020 M.I.T. review. Bach wrote long and often technical emails to Epstein; in 2016, he wrote to Epstein that \"black kids in the US have slower cognitive development\" and that women \"tend to find abstract systems, conflicts and mechanisms intrinsically boring.\" Bach stated that he continued to associate with Epstein after his conviction because highly respected academics recommended him as a funding source and \"assured me he was reformed,\" adding that researchers \"far more senior and famous than me were accepting such funds.\" He said his current view is \"that race is not causal for differences in development, and race is not a determinant of IQ in children or adults.\"",
    "category": "associate",
    "occupation": "Academic/Scientist",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Joscha_Bach"
  },
  {
    "name": "Steve Bannon",
    "description": "The documents included thousands of text messages between the alt right populist and Epstein, particularly from 2018 and 2019. The messages showed the two discussing efforts to influence international geopolitics, including shaping European coalitions, increasing pressure on China, and forging business ties in the Middle East. Epstein offered Bannon the use of a Paris apartment, a Palm Beach house, and his plane on multiple occasions; the two dined together frequently. Bannon provided media training to Epstein as part of work on a documentary and coached him as he faced increasing media scrutiny in early 2019. Bannon did not immediately respond to requests for comment. In March 2019, Bannon asked Epstein if he could supply his plane to pick him up in Rome. A couple of months later, Epstein",
    "category": "associate",
    "occupation": "Business Executive",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Steve_Bannon"
  },
  {
    "name": "Ehud Barak",
    "description": "A September 2013 email showed the former Israeli prime minister and defense minister informing Epstein that Larry Summers had withdrawn from consideration to chair the Federal Reserve, writing \"A major blow to a friend. ... Now he'll probably be free in the next few days.\" Later that day, Epstein emailed Barak to schedule meetings for him with billionaire banker Ariane de Rothschild and an individual referred to as the \"kissinger china guy.\" A representative for Barak did not respond to a request for comment. In a recording of Barak and Epstein released by the DOJ, Epstein encouraged Barak to \"look at\" working with Peter Thiel's company Palantir. Previously leaked emails from Barak's account show Epstein leveraged his relationship with Barak to approach powerful figures like Thiel, a forme",
    "category": "political",
    "occupation": "former Israeli prime minister",
    "nationality": "Israeli",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Ehud_Barak"
  },
  {
    "name": "Tom Barrack",
    "description": "In a March 2016 email exchange, Epstein told the real estate investor and Trump fundraiser that he had received calls from reporters asking about Trump but had refrained from commenting. Barrack responded, \"Hope ur good. Let's catch up\"; Epstein replied, \"send photos of you and child. — makes me smile.\" Embassy representatives for Barrack, who serves as U.S. ambassador to Turkey, did not respond to a request for comment.",
    "category": "political",
    "occupation": "real estate investor",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Tom_Barrack"
  },
  {
    "name": "Sergei Belyakov",
    "description": "Epstein emailed Sergei Belyakov, Russia's deputy minister of economic development, that a \"Russian girl\" was attempting to blackmail businessmen in New York.",
    "category": "political",
    "occupation": "Politician",
    "nationality": "Russian",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Sergei_Belyakov"
  },
  {
    "name": "Leon Black",
    "description": "Epstein sometimes referred to the private equity billionaire as \"Mr. Big\" in emails. Epstein sought to gather information about one of Black's former girlfriends and discussed putting her under surveillance; while Black was not copied on those emails, his lawyer was on some of them. Black, who paid Epstein a total of $170 million for what he characterized as tax and estate planning advice, told investors after Epstein's death that he was \"completely unaware\" of Epstein's misconduct. The documents included a list of payments from Black to a former model connected to Epstein, labeled as \"gifts,\" totaling more than $600,000. A spokesman for Black declined to comment.",
    "category": "legal",
    "occupation": "lawyer",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Legal counsel",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Leon_Black"
  },
  {
    "name": "Sultan Ahmed bin Sulayem",
    "description": "Bin Sulayem, the CEO of DP World, had Epstein ask Peter Mandelson to join the board of one of his companies in 2014. In February 2017, he introduced Indian businessman Anil Ambani to Epstein. Other exchanges between the two show Bin Sulayem facilitating the transfer of Epstein's masseuse to a spa in Turkey for training, Bin Sulayem sending Epstein a link to pornography, and Epstein advising Bin Sulayem on whether to attend Trump's first inauguration.",
    "category": "associate",
    "occupation": "Business Executive",
    "nationality": "Indian",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Sultan_Ahmed_bin_Sulayem"
  },
  {
    "name": "Todd Boehly",
    "description": "Emails from 2011 showed Epstein arranged two meetings with the businessman, who is now chairman of Chelsea F.C. and part-owner of the Los Angeles Dodgers and Los Angeles Lakers. At the time, Boehly was a managing partner at Guggenheim Partners. The first meeting took place in January 2011; a second was scheduled for September 2011 as a conference call, arranged in part to discuss British politician Peter Mandelson. A spokesperson for Boehly declined to comment. The emails did not suggest Boehly's engagements with Epstein extended beyond business.",
    "category": "associate",
    "occupation": "Los Angeles Dodgers",
    "nationality": "British",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Todd_Boehly"
  },
  {
    "name": "Leon Botstein",
    "description": "The longtime president of Bard College met with Epstein numerous times after his 2008 conviction, soliciting donations to the school. Epstein gave Bard $75,000 in unsolicited donations in 2011. Botstein invited Epstein to an opera at Bard in 2013 and a concert at the college in 2016; Epstein planned each time to bring young female assistants and arrive by helicopter. Botstein stated that the school had security ready due to Epstein's criminal record. In 2016, Botstein received checks from an Epstein-linked account totaling approximately $150,000, which he said he donated to Bard that year; a college spokesman confirmed the donation. Botstein stated that Epstein designated the payments as fees. A spokesman for Botstein said the funds were payment for a one-year term on the board of Gratitud",
    "category": "political",
    "occupation": "files were emails",
    "nationality": "Unknown",
    "status": "named",
    "role": "Employee / Associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Leon_Botstein"
  },
  {
    "name": "Richard Branson",
    "description": "A 2013 email exchange between Branson and Epstein suggested a familiar relationship built at least in part around their interest in women. The Virgin Group founder wrote to Epstein, \"Any time you're in the area would love to see you. As long as you bring your harem!\" A representative for Branson stated the email was sent after a group business meeting where Epstein had arrived with three adult women whom he called his \"harem\".",
    "category": "political",
    "occupation": "founder",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Richard_Branson"
  },
  {
    "name": "Sergey Brin",
    "description": "The documents indicated the Google co-founder visited Epstein's private island and corresponded with Ghislaine Maxwell about attending dinners at Epstein's home.",
    "category": "associate",
    "occupation": "founder",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Sergey_Brin"
  },
  {
    "name": "David Brooks",
    "description": "Brooks, who wrote a 2025 New York Times column dismissing the continuing media coverage of Epstein, appears in several photos in the Epstein Files, taken while Brooks was attending a 2011 event with Epstein.",
    "category": "associate",
    "occupation": "Media",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/David_Brooks_(commentator)"
  },
  {
    "name": "William Burns",
    "description": "Scheduling documents showed the CIA Director had three meetings scheduled with Epstein in 2014, when Burns was deputy secretary of state. They first met in Washington at the office of law firm Steptoe & Johnson, and Burns subsequently visited Epstein's Manhattan townhouse. A CIA spokeswoman stated that Burns was introduced to Epstein as \"an expert in the financial services sector\" who \"offered general advice on transition to the private sector\" as Burns was preparing to leave government service, adding that \"they had no relationship.\"",
    "category": "political",
    "occupation": "Director",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/William_J._Burns_(diplomat)"
  },
  {
    "name": "Noam Chomsky",
    "description": "An undated letter of support attributed to the linguist and philosopher called Epstein a \"highly valued friend\" and described their \"regular contact\" as \"a most valuable experience.\" The letter, which cited Chomsky's position as a University of Arizona laureate professor—a role he began in 2017—praised Epstein for teaching him \"about the intricacies of the global financial system\" and recounted how Epstein had arranged for Chomsky to meet with former Israeli prime minister Ehud Barak. In a 2015 email, Epstein offered Chomsky use of his residences in New York and New Mexico. An undated photograph released by House Oversight Committee Democrats showed Chomsky seated next to Epstein on a plane. In January 2017, Chomsky's wife Valeria emailed Epstein to apologize for missing his birthday, writ",
    "category": "political",
    "occupation": "linguist",
    "nationality": "Israeli",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Noam_Chomsky"
  },
  {
    "name": "Deepak Chopra",
    "description": "In a July 2016 exchange, the author asked Epstein if he knew Trump's ex-wife Marla Maples; Epstein replied that he had lost a $10,000 bet with Trump when Maples became pregnant. In November 2016, Epstein sent Chopra a news story claiming that a woman had fabricated allegations of assault by Trump and Epstein; when Epstein confirmed the civil charges against him had been dropped, Chopra responded \"Good.\" Chopra stated that he hoped \"all of the truth comes out after ongoing and proper investigations\" and was \"happy to share whatever I know with authorized officials.\"",
    "category": "associate",
    "occupation": "truth comes out after ongoing",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Deepak_Chopra"
  },
  {
    "name": "George Church",
    "description": "According to his online personal calendar, the Harvard geneticist met with Epstein multiple times in 2014, including an April meeting at Harvard Medical School's Genetics Department building and a June lunch; the calendar also listed a November 2014 dinner at Harvard's Program for Evolutionary Dynamics with Epstein, Joi Ito, Reid Hoffman, and Martin Nowak.",
    "category": "associate",
    "occupation": "Academic/Scientist",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/George_Church_(geneticist)"
  },
  {
    "name": "Bill Clinton",
    "description": "The documents included frequent communications between Maxwell and Clinton staffers between 2001 and 2004, a period during which the former president traveled on Epstein's plane at least 16 times. Much of the correspondence pertained to travel and dining logistics; in one April 2003 email, Maxwell asked a Clinton staffer if the former president would like to attend a dinner. Some emails between Maxwell and Clinton office addresses were flirtatious or lewd in nature; in one message, Maxwell said that the recipient was \"hung like a horse,\" and referenced \"Belzburg stuff,\" an apparent allusion to tabloid stories from 2002 about Clinton's association with New York socialite Lisa Belzberg. A Clinton spokesman stated that the former president did not send any of the emails and had \"never emailed",
    "category": "political",
    "occupation": "documents included frequent communications between Maxwell",
    "nationality": "Unknown",
    "status": "named",
    "role": "Employee / Associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Bill_Clinton"
  },
  {
    "name": "David Copperfield",
    "description": "Phone message pads seized by police from Epstein's Florida mansion in 2005 showed the illusionist left messages for Epstein 16 times over several months in 2004 and 2005, with notations including \"it's important,\" \"just called to say hello,\" and \"it's jackpot.\" Epstein's housekeeper Alfredo Rodriguez testified in a 2009 deposition that Copperfield was at the house \"maybe two or three times\" and \"came to the house, played tricks\" before leaving. Under questioning in a 2016 deposition, Epstein acknowledged he socialized with Copperfield; when asked whether he and Copperfield \"have been together in the presence of minor girls under the age of 18\" and whether he \"ever provided girls under the age 18 to David Copperfield for sexual purposes,\" Epstein invoked his Fifth Amendment right against se",
    "category": "legal",
    "occupation": "lawyer",
    "nationality": "Unknown",
    "status": "named",
    "role": "Legal counsel",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/David_Copperfield_(illusionist)"
  },
  {
    "name": "Jeffrey Epstein",
    "description": "Jeffrey Epstein was an American child sex offender, serial rapist, and human trafficker, who initially became famous for his purported success as a financier. He is the primary figure in the Epstein files, a collection of documents surrounding investigations into his crimes.",
    "category": "victim",
    "occupation": "Victim/Witness",
    "nationality": "American",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jeffrey_Epstein"
  },
  {
    "name": "Andrew Farkas",
    "description": "The New York real estate developer co-owned a marina with Epstein in St. Thomas for years. Documents showed the two men exchanged crude emails about women in 2010, after Epstein's first arrest and conviction. In a 2018 note, Farkas told Epstein he loved him and considered him one of his best friends, signing off \"xoxo.\" Farkas stayed on Epstein's island, and photographs released by Congress in late 2025 showed Epstein with his hand on Farkas's shoulder as they walked together in a tropical setting. Farkas had previously characterized the relationship as purely business-related; a spokeswoman told The New York Times in December 2025 that Farkas \"regrets their association.\"",
    "category": "associate",
    "occupation": "New York Times in December 2025",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Andrew_Farkas_(businessman)"
  },
  {
    "name": "Sarah Ferguson",
    "description": "Then known as Sarah, Duchess of York, the former wife of Andrew Mountbatten-Windsor (formerly Prince Andrew, Duke of York), thanked Epstein for being the \"brother\" she \"always wished for\" in an email sent in August 2009, a year after his conviction. In the exchange, Ferguson appeared to suggest she and her daughters, Princess Beatrice and Princess Eugenie, had met with Epstein, writing: \"I have never been more touched by a friends kindness than your compliment to me in front of my girls.\" Epstein was under house arrest when the email was sent, but Ferguson implied the pair had lunch the previous week; it has not been confirmed if she visited him while he was confined to his home. The emails also showed Ferguson discussing conversations she had with retailers regarding a \"Sarah Ferguson bra",
    "category": "political",
    "occupation": "former wife of",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Sarah_Ferguson"
  },
  {
    "name": "Bill Gates",
    "description": "The release contained draft emails written by Epstein in 2013, addressed to his own account, which made lurid allegations about Gates; it was not clear whether Epstein ever sent the emails to Gates. A representative for Gates called the claims \"absolutely absurd and completely false\" and stated they demonstrated Epstein's \"frustration that he did not have an ongoing relationship with Gates.\"",
    "category": "political",
    "occupation": "Politician",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Bill_Gates"
  },
  {
    "name": "Melinda French Gates",
    "description": "Draft emails written by Epstein alleged that Bill Gates had tried to surreptitiously give medication for sexually transmitted diseases to his then-wife, Melinda French Gates. Melinda French Gates responded to the documents by saying they filled her with \"unbelievable sadness\".",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "French",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Melinda_French_Gates"
  },
  {
    "name": "Joe Gibbs",
    "description": "Gibbs as well as his organization, Joe Gibbs Racing (JGR), are mentioned in 2 separate documents. In one document, what is believed to be a victim of Epstein recalls Gibbs as being very nice whilst calling Daniel Snyder a \"pig\". In the other, dated January 3, 2013 an unknown party rented a JGR aircraft from the organization.",
    "category": "victim",
    "occupation": "Victim/Witness",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Joe_Gibbs"
  },
  {
    "name": "Josh Harris",
    "description": "Harris, the co-founder of Apollo Global Management and Harris Blitzer Sports & Entertainment, had ongoing correspondence with Epstein between 2013 and 2016. Emails also show that Harris met with Epstein, Bill Gates, and Ron Baron at Epstein's New York home in 2014. A spokesperson for Harris said that Harris \"never had an independent relationship with Jeffrey Epstein.\"",
    "category": "associate",
    "occupation": "said",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Josh_Harris_(businessman)"
  },
  {
    "name": "Stephen Hawking",
    "description": "The renowned theoretical physicist was named in court documents released as part of a lawsuit involving Ghislaine Maxwell, a close associate of Jeffrey Epstein. These documents were unsealed following a New York judge's order, revealing over 70 names, including Hawking's, but without any evidence or allegations of misconduct linked to him. The documents included references to claims made by Virginia Giuffre, an alleged victim of Epstein, regarding Hawking's involvement in an \"underage orgy.\" Hawking, who died in 2018, was never charged with any sexual misconduct. In a 2015 email, Epstein suggested offering a reward to anyone who could disprove the allegations involving Hawking.",
    "category": "political",
    "occupation": "Royalty",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Stephen_Hawking"
  },
  {
    "name": "Reid Hoffman",
    "description": "Epstein's scheduling records showed the LinkedIn co-founder visited Epstein's island in November 2014; a calendar entry listed a reminder of Hoffman's arrival in Fort Lauderdale followed by a flight to \"LSJ,\" an apparent reference to Epstein's private island. Hoffman told The Wall Street Journal he visited the island once for an MIT fundraising trip and that his last interaction with Epstein was in 2015. The documents also contained email exchanges from 2015 and 2017, as well as scheduling records showing multiple Skype calls between the two in 2013 and 2014. In 2019, Hoffman stated his interactions with Epstein came at the request of then-MIT Media Lab Director Joi Ito for fundraising purposes; he said he regretted participating in any activity where Epstein was present. No victim of Epst",
    "category": "victim",
    "occupation": "founder",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Reid_Hoffman"
  },
  {
    "name": "Jack Horner",
    "description": "Jack Horner, a paleontologist that formerly worked for Montana State University, visited a property owned by Jeffrey Epstein in New Mexico in 2012 and exchanged several emails with him thereafter. These messages contain expressions of thanks for hospitality received and suggest a possible financial or logistical support for some of Horner's scientific projects. In particular, Epstein had apparently expressed interest in funding Horner's \"Dinochicken Project\", a project aiming to reverse-engineer a prehistoric dinosaur with the DNA of a chicken.",
    "category": "associate",
    "occupation": "Academic/Scientist",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jack_Horner_(paleontologist)"
  },
  {
    "name": "Joi Ito",
    "description": "The former director of the MIT Media Lab received $1.7 million from Epstein, including $1.2 million for his own outside investment funds. Internal emails showed Ito and other Media Lab officials took measures to conceal the lab's relationship with Epstein; in one 2014 email, Ito asked development staff to record a $100,000 donation from Epstein as \"anonymous.\" He twice traveled to Epstein's island in the Caribbean to seek donations. A separate October 2014 email showed Ito writing that a $2 million gift from Bill Gates had been \"directed by Jeffrey Epstein\"; a spokesman for Gates denied that Epstein directed any grant making for Gates and called the characterization \"completely false.\" Ito resigned from MIT in September 2019, as well as from the boards of the MacArthur Foundation, the Knig",
    "category": "political",
    "occupation": "director",
    "nationality": "Unknown",
    "status": "named",
    "role": "Employee / Associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Joi_Ito"
  },
  {
    "name": "Michael Jackson",
    "description": "Undated photographs released in December 2025 showed the singer posing with Epstein, including one in front of a painting of a nude woman. Another photograph showed Jackson with Bill Clinton and Diana Ross. It is unclear when or where the photos were taken or why they were in Epstein's possession; there is no suggestion Jackson was aware of, or involved in, any of Epstein's crimes.",
    "category": "associate",
    "occupation": "Entertainment",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Michael_Jackson"
  },
  {
    "name": "Thorbjørn Jagland",
    "description": "In a 2014 email to Epstein, former prime minister of Norway Thorbjørn Jagland had planned a family trip to Little Saint James island. The trip was eventually cancelled because of the annexation of Crimea by Russia, which caused Jagland, who was the secretary-general of the European Council at the time, to stay in Europe. Jagland was also the head of the Nobel Committee when he exchanged emails with Epstein. Norwegian Prime Minister Jonas Gahr Støre said Jagland had exercised \"poor judgement.\" Epstein told Jagland that he could advise Vladimir Putin on how to talk with Donald Trump.",
    "category": "political",
    "occupation": "prime minister",
    "nationality": "Norwegian",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Thorbj%C3%B8rn_Jagland"
  },
  {
    "name": "Jay-Z",
    "description": "According to an FBI crisis intake form that was included in the January 2026 release of Epstein files, an anonymous victim alleged that, after being drugged and sexually abused, she woke up in a room with the rapper and Harvey Weinstein.",
    "category": "victim",
    "occupation": "intake form",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jay-Z"
  },
  {
    "name": "Jimmie Johnson",
    "description": "In a 2013 email sent from a redacted sender, Johnson was CC'd in an email with Epstein, Jody Thibodeau, and another redacted recipient.",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jimmie_Johnson"
  },
  {
    "name": "John de Jongh Jr.",
    "description": "Emails in the files show that from 2008 to 2009 Epstein paid for the children of then–U.S. Virgin Islands Governor John de Jongh. The tuition invoices covered multiple universities and excluded room and board. After Cecile de Jongh, wife of John de Jongh and former first lady of the U.S. Virgin Islands, thanked Epstein in June 2009, Epstein described the payments as \"a treat\" and said \"Its as if i had my own kids in college.\" Epstein also paid college tuition for a student identified as \"Thomas\", the son of Jeanne Brennan Wiebracht, who was the former campaign accountant for John de Jongh.",
    "category": "political",
    "occupation": "files show",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/John_de_Jongh_Jr."
  },
  {
    "name": "Brad S. Karp",
    "description": "Documents showed the chair of law firm Paul Weiss attended dinner gatherings at Epstein's Upper East Side residence. In a July 2015 email, Karp wrote to Epstein: \"I can't thank you enough for including me in an evening I'll never forget. It was truly 'once in a lifetime' in every way, though I hope to be invited again.\" When Epstein replied that \"there are many many nights of unique talents. you will be invited often,\" Karp responded: \"You're amazing.\" In a separate July 2015 exchange, Epstein asked Karp about revoking a woman's visa; Karp responded, \"Both good ideas; will work on this.\" A July 2016 email showed Karp asking Epstein for help getting his son a job on a Woody Allen film production. In February 2019, Karp corresponded with Epstein about finding legal representation for Robert ",
    "category": "political",
    "occupation": "firm represented Leon Black in fee disputes with Epstein",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Brad_S._Karp"
  },
  {
    "name": "Mary Richardson Kennedy",
    "description": "Mary Richardson Kennedy, the estranged wife of Robert F. Kennedy Jr., committed suicide in 2012. An email within the Epstein files shows that upon learning of her death, Epstein responded by saying \"whoops\".",
    "category": "associate",
    "occupation": "Epstein files shows",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Mary_Richardson_Kennedy"
  },
  {
    "name": "Jeff Koons",
    "description": "In 2013, the artist attended a dinner party at Epstein's Upper East Side home. Koons said \"Beyond attending the dinner, I did not have a relationship with Epstein.\"",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jeff_Koons"
  },
  {
    "name": "Bobby Kotick",
    "description": "Epstein invited Kotick to events with \"the girls\" and was part of the conversation to add micro-transactions to Call of Duty.",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Bobby_Kotick"
  },
  {
    "name": "Lawrence Krauss",
    "description": "When reporters at BuzzFeed News were preparing an article about sexual misconduct allegations against the physicist in late 2017, Krauss reached out to Epstein for advice on how to respond. Epstein recommended that Krauss write a cover letter stating that the accusations were \"false\" and had been \"either investigated and found lacking or ignored.\" In 2018, Epstein forwarded Krauss a list of attendees for the Women in the World Summit; Krauss responded, \"Let's do a men of the world conference,\" listing men accused of misconduct including Kevin Spacey, Bill Clinton, Al Franken, and Woody Allen. Krauss announced his retirement from Arizona State University in 2018. He stated that he had never hidden his association with Epstein and had \"sought out advice from essentially everyone I knew\" when",
    "category": "political",
    "occupation": "association with Epstein",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Lawrence_Krauss"
  },
  {
    "name": "Sergey Lavrov",
    "description": "Epstein told Lavrov, the Russian foreign minister, he could give insight on President Donald Trump to Vladimir Putin.",
    "category": "political",
    "occupation": "President",
    "nationality": "Russian",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Sergey_Lavrov"
  },
  {
    "name": "Miroslav Lajčák",
    "description": "A Slovak diplomat and politician who served as the minister of foreign affairs of the Slovak Republic and president of the United Nations General Assembly. In late 2025 and early 2026, the \"Epstein files\" revealed extensive email correspondence between Lajčák and Epstein occurring between 2017 and 2019. According to the records, Lajčák allegedly asked Epstein to introduce him to \"young girls\" and boasted that Epstein had not yet seen him \"in action\". The files reportedly show that Epstein responded by offering him \"young girls and their sisters\" and Lajčák explicitly requested invitations to participate in Epstein's private \"games\". Lajčák's name appears more than 300 times throughout the documentation. A publicized photograph confirmed their personal connection, showing the two men togeth",
    "category": "political",
    "occupation": "minister of foreign affairs of the Slovak Republic",
    "nationality": "American",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Miroslav_Laj%C4%8D%C3%A1k"
  },
  {
    "name": "Howard Lutnick",
    "description": "Email correspondence showed that the Commerce Secretary coordinated a visit to Epstein's Caribbean compound in December 2012, though he had previously said he severed ties with Epstein around 2005. Lutnick previously said that in 2005 he and his wife were invited to Epstein's house, which was next door to theirs, for coffee, and that he did not associate with Epstein after that visit. A longtime Epstein aide reached out to Lutnick in November 2012 to arrange a meeting while Lutnick was in St. Thomas; Lutnick, accompanied by his wife Allison and their four children, agreed to a lunch on December 23 on Epstein's private island. Emails showed Lutnick and his wife coordinating logistics, including where to dock their yacht at Little St. James. The day after the scheduled meeting, an Epstein ai",
    "category": "political",
    "occupation": "wife Allison",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Howard_Lutnick"
  },
  {
    "name": "Peter Mandelson",
    "description": "Bank statements released by the DOJ showed three separate $25,000 payments referencing Mandelson sent from Epstein's JP Morgan accounts between 2003 and 2004, totaling $75,000; it is unclear whether the payments reached the named accounts. Mandelson stated he had no record or recollection of receiving the sums and did not know whether the documents were authentic. Separately, documents showed Epstein sent £10,000 (~ $15578) to Mandelson's husband, Reinaldo Avila da Silva, in 2009; emails suggested the funds were intended for an osteopathy course. In another set of emails, Mandelson asked to stay at one of Epstein's properties while Epstein was serving his jail term; the terms of Epstein's sentence allowed him to work from his office during the day and return to jail each night. An October ",
    "category": "political",
    "occupation": "sums",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Peter_Mandelson"
  },
  {
    "name": "Ghislaine Maxwell",
    "description": "Ghislaine Maxwell is a prominent former business partner of Epstein. In 2021, she was found guilty of child sex trafficking and other offences in connection with Epstein. The Epstein files contain accounts of her crimes by victims as well as details about court testimonies from accusers and civil claims against her.",
    "category": "political",
    "occupation": "found guilty of child sex trafficking",
    "nationality": "Unknown",
    "status": "convicted",
    "role": "Co-conspirator",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Ghislaine_Maxwell"
  },
  {
    "name": "Robert Maxwell",
    "description": "Following the death of Robert Maxwell, Epstein had written an email speculating about his death. Epstein alleged that Maxwell was a spy working for Mossad that was killed because he attempted to blackmail the agency for £400 million, threatening to reveal his spy activity if not paid.",
    "category": "political",
    "occupation": "a spy working for Mossad",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Robert_Maxwell"
  },
  {
    "name": "Mette-Marit, Crown Princess of Norway",
    "description": "She was mentioned over a thousand times in the Epstein files, with communications spanning 2011 to 2014. Documents showed she spent four days at Epstein's house in Palm Beach in January 2013; one message implied she was aware of his 2008 jail term. In one email from her account, Epstein was asked whether a mother should suggest naked women carrying a surfboard for her son's wallpaper. In response to the release, she stated: \"I showed poor judgement and regret having any contact with Epstein at all. It is simply embarrassing.\" She expressed \"deep sympathy and solidarity with the victims of the abuses committed by Jeffrey Epstein.\" Norwegian prime minister Jonas Gahr Støre said he agreed with Mette-Marit's admission of poor judgement.",
    "category": "political",
    "occupation": "prime minister",
    "nationality": "Norwegian",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Mette-Marit,_Crown_Princess_of_Norway"
  },
  {
    "name": "George J. Mitchell",
    "description": "A 2003 handwritten letter in Epstein's \"birthday book\" showed the former U.S. Senate majority leader describing his friendship with Epstein as \"a blessing.\" Documents released in January 2026 showed a continued relationship between Mitchell and Epstein following Epstein's 2008 conviction, including emails and scheduled appointments; a November 2013 email listed \"10:30am Appt w/Senator George Mitchell.\" The files also contained references to an allegation by Virginia Giuffre, first made in a May 2016 deposition, that Ghislaine Maxwell had directed her to have sex with Mitchell. A spokesperson for Mitchell stated that he never met, spoke to, or had any contact with Giuffre or any underage women, and that the allegation was based on mistaken identity. The spokesperson said Mitchell learned of",
    "category": "political",
    "occupation": "Senator",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/George_J._Mitchell"
  },
  {
    "name": "Andrew Mountbatten-Windsor",
    "description": "In a 2010 email exchange, Epstein offered to introduce then-Prince Andrew to a 26-year-old Russian woman, to which he replied he would be \"delighted\" to meet her. The same exchange showed the former royal inviting Epstein to have dinner at Buckingham Palace and to \"come with whomever\"; it is unclear whether such a visit occurred. Epstein and Mountbatten-Windsor were pictured walking together in New York's Central Park three months later; Mountbatten-Windsor had previously claimed he travelled to the United States to end his friendship with Epstein in person in light of his conviction. The former royal was also photographed with a woman lying on the ground in three undated photos. The BBC noted the emails did not indicate any wrongdoing. Epstein victim Virginia Giuffre, who died in 2025, ac",
    "category": "political",
    "occupation": "Royalty",
    "nationality": "Russian",
    "status": "deceased",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Andrew_Mountbatten-Windsor"
  },
  {
    "name": "Robert Mugabe",
    "description": "An FBI source said Epstein was providing financial management services to the Zimbabwean president.",
    "category": "political",
    "occupation": "president",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Robert_Mugabe"
  },
  {
    "name": "Elon Musk",
    "description": "Emails from 2012 to 2014 showed Epstein making repeated overtures to meet with Musk, with the latter citing schedule conflicts and logistical complications; the communications did not reflect any actual in-person meetings between the two. One email exchange from mid-December 2013 to early 2014 showed Epstein and Musk coordinating a possible holiday visit to Epstein's compound in the U.S. Virgin Islands. In late 2012, Musk asked Epstein about attending \"the wildest party\" on his island and wrote in December that he wanted to \"hit the party scene in St Barts or elsewhere and let loose\"; when Epstein replied that \"the ratio on my island might make Talulah uncomfortable,\" referring to Musk's then-wife Talulah Riley, Musk responded that \"ratio is not a problem for Talulah.\" Musk also suggested ",
    "category": "political",
    "occupation": "latter citing schedule conflicts",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Elon_Musk"
  },
  {
    "name": "Mira Nair",
    "description": "The film director was named in the January 2026 release of the files, having been mentioned by name in an email from publicist Peggy Siegal to Epstein, who wrote that she saw Nair at an after-party for the 2009 film Amelia, which Nair directed. The email implies no wrongdoing on Nair's part nor does it suggest a relationship between Nair and Epstein.",
    "category": "associate",
    "occupation": "director",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Mira_Nair"
  },
  {
    "name": "Elisa New",
    "description": "In 2015, the Harvard professor of American literature wrote to Epstein to thank him for a donation he had arranged, stating: \"you have been such a wonderful supporter of my Poetry in America project. That gift woke up the Deans to the importance of Harvard's role in producing the highest quality humanities content in the WORLD.\" A 2020 Harvard review found that one of Epstein's foundations claimed on tax forms in 2016 that it had donated $110,000 to a nonprofit organization of which New was president. New issued a statement apologizing for maintaining contact with Epstein.",
    "category": "political",
    "occupation": "professor",
    "nationality": "American",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Elisa_New"
  },
  {
    "name": "Martin Nowak",
    "description": "In 2003, Epstein donated $6.5 million to establish Harvard's Program for Evolutionary Dynamics, which Nowak led. Epstein visited Harvard approximately 40 times after his release from jail in 2009, according to a university review. In 2017, Epstein introduced Nowak to his publicist, Masha Drokova, to arrange an interview; Drokova later emailed Epstein to say that she \"had a great conversation with Martin\" and that \"he loves you.\" After publishing a report on its financial ties to Epstein in 2020, Harvard placed Nowak under sanctions for two years and shuttered the Program for Evolutionary Dynamics; he remains a professor of mathematics and of biology at Harvard. Nowak did not immediately respond to a request for comment. According to The Times, Nowak emailed Ghislaine Maxwell to thank her f",
    "category": "associate",
    "occupation": "professor",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Martin_Nowak"
  },
  {
    "name": "Mehmet Oz",
    "description": "A transaction report from 2004 showed Epstein paid $1,592 for the travel expenses of Oz, who currently serves as administrator of the Centers for Medicare and Medicaid Services. Epstein was invited to a 2014 event at which Oz was a guest speaker, but wrote in an email that he was unavailable to attend. The files also contained a 2016 email from Oz to Epstein, though its contents were redacted. The Centers for Medicare and Medicaid Services did not immediately respond to a request for comment.",
    "category": "associate",
    "occupation": "Centers for Medicare",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Mehmet_Oz"
  },
  {
    "name": "Stacey Plaskett",
    "description": "Text messages appeared to show Epstein communicating with the delegate representing the U.S. Virgin Islands during a February 2019 House Oversight Committee hearing in which Michael Cohen testified against Trump. Though the recipient's name was redacted, timestamps and message contents appeared to indicate Epstein was texting Plaskett. During the exchange, Epstein noted that Cohen had mentioned Trump's executive assistant Rhona Graff; shortly afterward, Plaskett asked Cohen about Graff during her questioning. Plaskett's office stated that during the hearing she \"received texts from staff, constituents and the public at large offering advice, support and in some cases partisan vitriol, including from Epstein,\" and emphasized her \"long record combating sexual assault and human trafficking\" a",
    "category": "political",
    "occupation": "Royalty",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Co-conspirator",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Stacey_Plaskett"
  },
  {
    "name": "Christopher Poole",
    "description": "In October 2011, Epstein met with Christopher Poole (a.k.a. moot), the founder of 4chan. Coincidentally, on the same day that the meeting took place, Poole created the political discussion board /pol/. Epstein later wrote to the person who introduced him to Poole that \"I liked mmot alot\" and \"I drove him home, he is very bright.\"",
    "category": "associate",
    "occupation": "same day",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Christopher_Poole"
  },
  {
    "name": "Soon-Yi Previn",
    "description": "Soon-Yi Previn, the wife of Woody Allen, maintained email correspondence with Epstein. In various emails, she said that the MeToo movement had \"gone too far\" and described a 15-year-old victim of Anthony Weiner as \"despicable and disgusting\". She wrote of the child victim, \"I hate women who take advantage of guys and she is definitely one of them. She knew exactly what she was doing and how vulnerable was and she reeled him in like fish to bait.\" Also included in the documents was a series of emails showing that Epstein helped Allen and Previn's daughter Bechet get into Bard College by connecting her to the school's president, Leon Botstein, a longtime acquaintance.",
    "category": "political",
    "occupation": "doing",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Soon-Yi_Previn"
  },
  {
    "name": "Pusha T",
    "description": "The rapper is mentioned in an FBI crisis intake form that was released with other Epstein files in January 2026, showing that an anonymous victim alleged that Pusha T had been one of her \"handlers\" during the years she had experienced being drugged and sexually abused.",
    "category": "victim",
    "occupation": "rapper is mentioned in an FBI crisis intake form",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Pusha_T"
  },
  {
    "name": "Vladimir Putin",
    "description": "Epstein attempted to win an audience with Vladimir Putin for years in the 2010s to discuss proposals about foreign investment. Notably, he leveraged his contact with Thorbjorn Jagland, the former prime minister of Norway, to facilitate the arrangement of said meeting. Epstein also communicated with Ehud Barak about his hopes to meet Putin. It is unclear whether the meeting ever happened. The president's name appears more than a thousand times in the January Epstein files release, but many references are only tangential, such as in media bulletins sent to Epstein's email. The Kremlin dismissed Western claims that Epstein was a Russian intelligence asset.",
    "category": "political",
    "occupation": "Kremlin dismissed Western claims",
    "nationality": "Russian",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Vladimir_Putin"
  },
  {
    "name": "Penny Pritzker",
    "description": "American businesswoman Penny Pritzker was a subject of discussion between her cousin Tom Pritzker and Jeffrey Epstein. Tom Pritzker alleged that Penny had understated her income by roughly $80 million.",
    "category": "associate",
    "occupation": "a subject of discussion between her cousin Tom Pritzker",
    "nationality": "American",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Penny_Pritzker"
  },
  {
    "name": "Tom Pritzker",
    "description": "In a May 2013 email exchange, the billionaire chairman of Hyatt Hotels forwarded Epstein a news article reporting that his cousin Penny Pritzker, then President Obama's nominee to lead the Commerce Department, had understated her income by roughly $80 million. Pritzker wrote to Epstein, \"I clearly did something wrong in my last life to have to deal w this bulls---. AND I warned her\"; Epstein responded \"nice to see you\" and \"please come more often,\" and Pritzker replied \"Always fun.\" A representative for Tom Pritzker declined to comment.",
    "category": "political",
    "occupation": "President",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Tom_Pritzker"
  },
  {
    "name": "Hardeep Singh Puri",
    "description": "An email from Puri, currently India's Petroleum Minister, to Epstein in November 2014 detailed reasons for engaging with India following Prime Minister Narendra Modi's election. At the time, Puri had retired from the Indian Foreign Service and was working with the International Peace Institute. Puri did not deny sending the email but did not comment on its contents; BJP spokespersons called Epstein's claims \"bogus\" and \"drunk bragging on mail.\"",
    "category": "political",
    "occupation": "Indian Foreign Service",
    "nationality": "Indian",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Hardeep_Singh_Puri"
  },
  {
    "name": "Marc Rowan",
    "description": "Emails showed the Apollo Global Management CEO corresponded with Epstein over the firm's tax arrangements throughout the 2010s, despite Apollo having stated in 2020 that it \"never did any business\" with Epstein. In March 2016, Rowan forwarded Epstein a detailed internal calculation regarding Apollo's tax receivable agreement. Documents showed Epstein was involved in discussions about a possible tax \"inversion\" deal that would have redomiciled Apollo overseas; in one 2016 exchange, Epstein wrote that \"using rothschild for the inversion allows interesting structures,\" and Rowan responded in agreement. An email from Epstein described a meeting that appeared to be with Rowan: \"Mark was here this morning; we talked Athene, Montauk, Rothschild. Planes boats etc.\" In 2015, Apollo partner Sanjay P",
    "category": "associate",
    "occupation": "Financial Times",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Marc_Rowan"
  },
  {
    "name": "Kathryn Ruemmler",
    "description": "Documents showed Epstein sent numerous gifts to Ruemmler, a former White House Counsel under Barack Obama and currently general counsel of Goldman Sachs, who was at the time a lawyer at Latham & Watkins. The gifts included flowers, wine, an Hermès bag, $10,000 in Bergdorf Goodman gift cards, spa treatments, an Apple Watch, and \"1 million amex points.\" Previous Epstein file releases had shown that the two corresponded frequently. Ruemmler stated that her relationship with Epstein was professional and that she regularly interacted with criminals as part of her job, adding: \"I regret ever knowing him, and I have enormous sympathy for the victims of Epstein's crimes.\" In a 2019 email, Ruemmler wrote to Epstein: \"Am totally tricked out by Uncle Jeffrey today!\" In released emails with Epstein an",
    "category": "legal",
    "occupation": "professional",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Kathryn_Ruemmler"
  },
  {
    "name": "Joshua Cooper Ramo",
    "description": "Scheduling documents showed the then co-CEO of Henry Kissinger's corporate consulting firm had more than a dozen meetings with Epstein from 2013 to 2017, many in the evenings at Epstein's Manhattan townhouse. Ramo was invited to a breakfast at the townhouse in September 2013 with former Israeli prime minister Ehud Barak. At the time, Ramo served on the boards of Starbucks and FedEx. He did not respond to requests for comment; a spokeswoman for Kissinger said he was unaware that Ramo was meeting with Epstein.",
    "category": "political",
    "occupation": "boards of Starbucks",
    "nationality": "Israeli",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Joshua_Cooper_Ramo"
  },
  {
    "name": "Brett Ratner",
    "description": "The film director appeared in undated photographs with Epstein and Jean-Luc Brunel, a late French modeling agent and longtime associate of Epstein. Additional images released in January 2026 showed Ratner seated on a sofa beside Epstein and two women whose identities were obscured; a series of thumbnails showed Ratner, Epstein, and Brunel with different women. There was no indication of wrongdoing in the files.",
    "category": "associate",
    "occupation": "film director appeared in undated photographs with Epstein",
    "nationality": "French",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Brett_Ratner"
  },
  {
    "name": "Ariane de Rothschild",
    "description": "Scheduling documents showed the CEO of Swiss private bank Edmond de Rothschild Group had more than a dozen meetings with Epstein from 2013 to 2019. She bought nearly $1 million worth of auction items on Epstein's behalf in 2014 and 2015, and in October 2015 negotiated a $25 million contract for Epstein's Southern Trust Co. to provide risk analysis services for the bank. In 2019, following Epstein's arrest, the bank initially stated that de Rothschild had never met with Epstein and the bank had no business links with him; the bank later acknowledged to The Wall Street Journal that this statement was not accurate. The bank stated that de Rothschild had no knowledge of any legal proceedings against Epstein and \"was similarly unaware of any questions regarding his personal conduct.\"",
    "category": "associate",
    "occupation": "bank initially stated",
    "nationality": "Swiss",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Ariane_de_Rothschild"
  },
  {
    "name": "Andres Serrano",
    "description": "The photographer photographed Epstein shortly before Epstein's death in 2019. In 2016, Serrano emailed Epstein that he was considering a \"sympathy vote\" for Trump because of outrage about the Donald Trump Access Hollywood tape.",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Andres_Serrano"
  },
  {
    "name": "Peggy Siegal",
    "description": "The American publicist Peggy Siegal had corresponded with Epstein in 2009 during a trip to Kenya. In the email correspondence, she had offered to \"bring a little baby back for you….or two.\" She also stated that she planned to pose for photographs in \"mud huts\" and pretend that she had \"crashed the winter White House\" and posed \"with Obama's relatives.\"",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "American",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Peggy_Siegal"
  },
  {
    "name": "Princess Sofia, Duchess of Värmland",
    "description": "The Swedish royal and former model met with Epstein on a few occasions in 2005, prior to her marriage, while she was living in New York City. An email from 2005 showed that Epstein invited her to his Caribbean estate, which the Swedish Royal Court claims she declined. A 2010 photograph of the princess was sent to Epstein by her mentor, financier Barbro Ehnbom. Epstein invited Sofia to a private Broadway screening in New York in 2012.",
    "category": "political",
    "occupation": "Swedish royal",
    "nationality": "Swedish",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Princess_Sofia,_Duchess_of_V%C3%A4rmland"
  },
  {
    "name": "Kevin Spacey",
    "description": "Undated photographs showed the actor standing with Epstein. Other images showed Spacey visiting the Churchill War Rooms with Bill Clinton and Ghislaine Maxwell during a 2002 visit to the UK as part of a Clinton Foundation humanitarian trip. Spacey told journalist Piers Morgan in 2024 that he traveled on Epstein's plane for the foundation trip but that \"he never spent time with him.\" He has not been accused of wrongdoing in relation to Epstein.",
    "category": "associate",
    "occupation": "Churchill War Rooms with Bill Clinton",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Kevin_Spacey"
  },
  {
    "name": "Jes Staley",
    "description": "In December 2025, it was revealed that Staley and Lawrence Summers had been appointed by Epstein as executors of his estate.",
    "category": "associate",
    "occupation": "revealed",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Jes_Staley"
  },
  {
    "name": "Lawrence H. Summers",
    "description": "Emails showed the former Treasury Secretary and Harvard president discussed with Epstein his romantic pursuit of a woman; in one exchange, Epstein referred to himself as a \"good wing man.\" Communications between the two continued until days before Epstein's arrest in July 2019. Summers stepped back from teaching while Harvard reviews his links to Epstein.",
    "category": "political",
    "occupation": "former Treasury Secretary",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Lawrence_H._Summers"
  },
  {
    "name": "Peter Thiel",
    "description": "Documents showed that an investment firm co-founded by the venture capitalist accepted $40 million from Epstein and that the two corresponded for at least five years before Epstein's death. In 2018, Epstein urged Thiel to \"Visit me Caribbean.\" A spokesman for Thiel declined to comment on the relationship but said Thiel \"never went to Epstein's island.\"",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "deceased",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Peter_Thiel"
  },
  {
    "name": "Steve Tisch",
    "description": "Emails from 2013 show the New York Giants co-owner and Epstein discussing women, with Epstein describing their physical features. In a statement, Tisch said: \"We had a brief association where we exchanged emails about adult women, and in addition, we discussed movies, philanthropy and investments. I did not take him up on any of his invitations and never went to his island. As we all know now, he was a terrible person and someone I deeply regret associating with.\"",
    "category": "associate",
    "occupation": "invitations",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Steve_Tisch"
  },
  {
    "name": "Robert Trivers",
    "description": "The evolutionary biologist told Reuters in 2015 that Epstein had given him about $40,000 for his research. In December 2018, Trivers emailed Epstein about funding, writing that Epstein had once said he would \"never not support me.\" In 2015, Trivers defended Epstein to Reuters, stating that girls \"mature sooner than they used to\" and that he did not \"see these acts as so heinous.\" Trivers did not respond to requests for comment.",
    "category": "associate",
    "occupation": "evolutionary biologist told Reuters in 2015",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Robert_Trivers"
  },
  {
    "name": "Donald Trump",
    "description": "The New York Times identified more than 5,300 files containing over 38,000 references to Trump, his wife, Mar-a-Lago, and related terms in the January 2026 release; many were news articles or publicly available materials, and none included direct communication between Trump and Epstein. Trump was among half a dozen prominent men about whom the FBI's files included what an official described as \"salacious information,\" according to internal correspondence; the agency compiled tips about Trump into a summary that was released but contained no corroborating information. An 2011 email from the DOJ's files indicates that Epstein planned to call Trump regarding Virginia Giuffre; Trump has claimed he parted ways earlier. Handwritten notes from a September 2019 victim interview described being tra",
    "category": "political",
    "occupation": "among half a dozen prominent men about",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Donald_Trump"
  },
  {
    "name": "Melania Trump",
    "description": "In a 2002 email, Melania Trump wrote to an individual identified as \"G\" to congratulate her on a New York magazine profile of Epstein. Though the recipient's email address was redacted, Epstein's then-girlfriend Ghislaine Maxwell was photographed in the article. Melania Trump did not immediately respond to a request for comment.",
    "category": "associate",
    "occupation": "Media",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Melania_Trump"
  },
  {
    "name": "Brian Vickers",
    "description": "Documents showed correspondence between the former NASCAR driver and Epstein dating back to at least 2012. Vickers' ex-wife Sarah Kellen has been named as a co-conspirator in Epstein's sex trafficking operation; Kellen has said she is a victim of Epstein, though in 2007 she was accused by authorities in Palm Beach, Florida, of helping recruit young women to provide sex for Epstein. In March 2012, Vickers forwarded Epstein an email with sexually explicit content. In 2013, emails showed Epstein working behind the scenes on NASCAR sponsorships for Vickers after news of Kellen's involvement with Epstein began to surface; Epstein wrote that he had contacted Michael Waltrip Racing co-owners Michael Waltrip and Rob Kauffman to address concerns that sponsor Aaron's might not follow through on a de",
    "category": "political",
    "occupation": "former NASCAR driver",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Co-conspirator",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Brian_Vickers"
  },
  {
    "name": "Michael Waltrip",
    "description": "2013 emails between Brian Vickers and Epstein showed Waltrip, then owner of Michael Waltrip Racing was made aware of currently undisclosed allegations made against Vickers that would potentially hamper their sponsorship efforts going forward from anchor partner Aaron's. This happened discussing sponsorships for the 2014 season with co-owner Rob Kauffman, and the pair would state \"They are good with it on a personal level, but said they have to keep the best interest of the team in mind.\"",
    "category": "associate",
    "occupation": "Named Individual",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Michael_Waltrip"
  },
  {
    "name": "Casey Wasserman",
    "description": "The chairman of the Los Angeles Organizing Committee for the 2028 Olympic and Paralympic Games exchanged personal emails with Maxwell in March and April 2003; in one message, Maxwell offered Wasserman a massage that could \"drive a man wild.\" Other documents showed Wasserman and his then-wife flew on Epstein's private jet in September 2002 alongside Maxwell, Epstein, Bill Clinton, Kevin Spacey, and others as part of a humanitarian trip organized by the Clinton Foundation to address HIV in Africa; the trip had been previously documented in a 2003 Vanity Fair story. In a statement, Wasserman said he regretted the correspondence, which he said occurred \"long before her horrific crimes came to light.\" He stated that he \"never had a personal or business relationship with Jeffrey Epstein\" and sai",
    "category": "associate",
    "occupation": "Business Executive",
    "nationality": "Unknown",
    "status": "named",
    "role": "Business associate",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Casey_Wasserman"
  },
  {
    "name": "Anthony Weiner",
    "description": "The politician and sex offender Anthony Weiner had been the subject of discussion between Jeffrey Epstein and Soon-Yi Previn. Following Weiner's sexting scandals, Previn said to Epstein that Weiner's 15-year-old victim was \"despicable and disgusting\". She alleged that the child victim had manipulated and preyed upon Weiner.",
    "category": "victim",
    "occupation": "politician",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Anthony_Weiner"
  },
  {
    "name": "Harvey Weinstein",
    "description": "The former film producer is mentioned in an FBI crisis intake form that was released with other Epstein files in January 2026. An anonymous victim alleged that, after being drugged and sexually abused, she woke up in a room with Weinstein and Jay-Z.",
    "category": "victim",
    "occupation": "Victim/Witness",
    "nationality": "Unknown",
    "status": "victim",
    "role": "Victim / Witness",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Harvey_Weinstein"
  },
  {
    "name": "Les Wexner",
    "description": "In emails from Epstein's account obtained by Distributed Denial of Secrets, Wexner messaged Epstein prior to Epstein's guilty plea in 2008 writing, \"All I can say is I feel sorry. You violated your own number 1 rule ... Always be careful.\" Wexner claimed to have severed ties with Epstein in 2007. These emails were not released by the DOJ.",
    "category": "key figure",
    "occupation": "Co-conspirator",
    "nationality": "Unknown",
    "status": "convicted",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Les_Wexner"
  },
  {
    "name": "Michael Wolff",
    "description": "Documents showed extended correspondence between the journalist and Epstein; Wolff has previously said Epstein was a source for his 2018 book Fire and Fury. In December 2015, Wolff told Epstein that CNN planned to ask Trump about his relationship with Epstein; when Epstein asked about crafting an answer, Wolff responded, \"I think you should let him hang himself.\" In October 2016, after the Access Hollywood tape surfaced, Wolff wrote to Epstein that there was an \"opportunity to come forward this week and talk about Trump in such a way that could garner you great sympathy and help finish him.\" Wolff described the emails as \"embarrassing\" but defended his approach as \"playacting\" to obtain information about Trump.",
    "category": "associate",
    "occupation": "journalist",
    "nationality": "Unknown",
    "status": "named",
    "role": "Named individual",
    "aliases": [],
    "source": "wikipedia",
    "wikiUrl": "https://en.wikipedia.org/wiki/Michael_Wolff_(journalist)"
  }
]